print(r'''
          /\
         /**\
        /****\   /\
       /      \ /**\
      /  /\    /    \        /\    /\  /\      /\            /\/\/\  /\
     /  /  \  /      \      /  \/\/  \/  \  /\/  \/\  /\  /\/ / /  \/  \
    /  /    \/ /\     \    /    \ \  /    \/ /   /  \/  \/  \  /    \   \
   /  /      \/  \/\   \  /      \    /   /    \
__/__/_______/___/__\___\__________________________________________________
''')


print("Καλώς ήρθες στα βουνά της Πεϊκοβας!")
print("Μόνο οι πραγματικοί Αγιομαρκίτες μπορούν να επιβιώσουν!")
print("Στις ερωτήσεις κλειστού τύπου απαντάς με ναι/όχι.")

ONOMA = input("Πώς σε λένε; ")
print("Ωραία {}!".format(ONOMA))

choice1 = input("Είσαι έτοιμος; ")


_             /XXXXXX\_                                    __
X\__    __   /X XXXX XX\                          _       /XX\__      ___
    \__/  \_/__       \ \                       _/X\__   /XX XXX\____/XXX\
  \  ___   \/  \_      \ \               __   _/      \_/  _/  -   __  -  \__/
 ___/   \__/   \ \__     \\__           /  \_//  _ _ \  \     __  /  \____//
/  __    \  /     \ \_   _//_\___     _/    //           \___/  \/     __/
__/_______\________\__\_/________\_ _/_____/_____________/_______\____/_______
                                  /|\
                                 / | \
                                /  |  \
                               /   |   \
                              /    |    \
                             /     |     \
                            /      |      \
                           /       |       \
                          /        |        \
                         /         |         \
''')
    choice2 = input("Ανεβαίνοντας για το σπίτι του Γίαννη στην ανηφόρα πας ΔΕΞΙΑ ή ΑΡΙΣΤΕΡΑ;")

    if choice2 == "ΑΡΙΣΤΕΡΑ":
        print("Αυτό το ξέρει και ο Τσίκης, πάμε σε κάτι πιο δύσκολο")
        print(r''' 
           *  .  . *       *    .        .        .   *    ..
         .    *        .   ###     .      .        .            *
            *.   *        #####   .     *      *        *    .
          ____       *  ######### *    .  *      .        .  *   .
         /   /\  .     ###\#|#/###   ..    *    .      *  .  ..  *
        /___/  ^8/      ###\|/###  *    *            .      *   *
        |   ||%%(        # }|{  #
        |___|,  \\  ejm    }|{
        ''')
        choice3 = input("Είναι βράδυ και ακούς κάτι περίεργους ήχους πίσω από τη συκιά.\n "
                        "Πας ΔΕΞΙΑ για να τσκεκάρεις τι είναι ή πας ΑΡΙΣΤΕΡΑ, για να μπεις μέσα στο σπίτι;")
        if choice3 == "ΑΡΙΣΤΕΡΑ":
            print("Του φοβιτσιάρη η μάνα δεν έκλαψε ποτέ")
            choice4 = input("Μπαίνεις μέσα στο σπίτι και βλέπεις ένα σύννεφο καπνού. Φταίει η καπνίλα από τα πούρα του"
                                " Γίαννη αλλά μπορεί κάτι να πηγαίνει λάθος με τη σομπα. Πας να ανοίξεις τη σόμπα γιατί ο Αζαρίας"
                                " είναι τεμπέλαρος και δεν πρόκειται να το κάνει;")
            if choice4 == "ΝΑΙ":
                    print("Μπράβο μόλις έσωσες απο σίγουρο θάνατο όλα τα ζώα που κοιμούνται!")
                    print(" Είσαι 100% Πεϊκοβαλής!")
                    print(r'''  
                                   .''.       
       .''.      .        *''*    :_\/_:     . 
      :_\/_:   _\(/_  .:.*_\/_*   : /\ :  .'.:.'.
  .''.: /\ :   ./)\   ':'* /\ * :  '..'.  -=:o:=-
 :_\/_:'.:::.    ' *''*    * '.\'/.' _\(/_'.':'.'
 : /\ : :::::     *_\/_*     -= o =-  /)\    '  *
  '..'  ':::'     * /\ *     .'/.\'.   '
      *            *..*      ''')
            else:
                    print("Game over, πέθανες από τις αναθυμιάσεις της σόμπας")
                    print(r'''       
           )           (              )
                 .  '   .   '  .  '  .
        (    , )       (.   )  (   ',    )
         .' ) ( . )    ,  ( ,     )   ( .
      ). , ( .   (  ) ( , ')  .' (  ,    )
     (_,) . ), ) _) _,')  (, ) '. )  ,. (' )
 jgs^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ ''' )

        else:
            print(r''' 
                                   ,-.
               ___,---.__          /'|`\          __,---,___
            ,-'    \`    `-.____,-'  |  `-.____,-'    //    `-.
          ,'        |           ~'\     /`~           |        `.
         /      ___//              `. ,'          ,  , \___      \
        |    ,-'   `-.__   _         |        ,    __,-'   `-.    |
        |   /          /\_  `   .    |    ,      _/\          \   |
        \  |           \ \`-.___ \   |   / ___,-'/ /           |  /
         \  \           | `._   `\\  |  //'   _,' |           /  /
          `-.\         /'  _ `---'' , . ``---' _  `\         /,-'
             ``       /     \    ,='/ \`=.    /     \       ''
                     |__   /|\_,--.,-.--,--._/|\   __|
                     /  `./  \\`\ |  |  | /,//' \,'  \
                    /   /     ||--+--|--+-/-|     \   \
                   |   |     /'\_\_\ | /_/_/`\     |   |
                    \   \__, \_     `~'     _/ .__/   /
                     `-._,-'   `-._______,-'   `-._,-'
            ΜΠΟΥΑΧΑΧΑ ΣΕ ΕΦΑΓΕ ΤΟ ΜΕΓΑΛΟ ΑΖΑΡ ΠΟΥ ΕΚΛΕΒΕ ΣΥΚΑ!''')
    else:
        print(r''' 
                                          __
                                    .d$$b
                                  .' TO$;\
                                 /  : TP._;
                                / _.;  :Tb|
                               /   /   ;j$j
                           _.-"       d$$$$
                         .' ..       d$$$$;
                        /  /P'      d$$$$P. |\
                       /   "      .d$$$P' |\^"l
                     .'           `T$P^"""""  :
                 ._.'      _.'                ;
              `-.-".-'-' ._.       _.-"    .-"
            `.-" _____  ._              .-"
           -(.g$$$$$$$b.              .'
             ""^^T$$$P^)            .(:
               _/  -"  /.'         /:/;
            ._.'-'`-'  ")/         /;/;
         `-.-"..--""   " /         /  ;
        .-" ..--""        -'          :
        ..--""--.-"         (\      .-(\
          ..--""              `-\(\/;`
            _.                      :
                                    ;`-
                                   :\
                                   ; 
            "Game over, Σε φάγανε οι λύκοι''')
else:
    print("Game over κόρη, αϊ γαμις")
